<?xml version="1.0"?>
<rss version="2.0">
  <channel>
    <title>0x1d107's microblog posts</title>
    <link>http://119047.xyz/txtlog/0x1d107.xml</link>
    <description>0x1d107's microblog posts</description>
    <item>
      <description>&#x41D;&#x443;, &#x447;&#x442;&#x43E; &#x436;. &#x414;&#x430;&#x436;&#x435; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x44E; &#x43E; &#x447;&#x435;&#x43C; &#x442;&#x443;&#x442; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C;... &#x421; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x43E;&#x433;&#x43E; &#x431;&#x43B;&#x438;&#x442;&#x430; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E;
&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x43B;&#x43E;&#x441;&#x44C;. &#x412;&#x43E;&#x442; &#x443;&#x43D;&#x438;&#x432;&#x435;&#x440; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x441;&#x44F;, &#x438; &#x445;&#x43E;&#x442;&#x44F; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E;, &#x43D;&#x43E; &#x436;&#x435;&#x43B;&#x430;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x442;&#x44C;
&#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x43D;&#x435;&#x442;. 
&#x425;&#x43E;&#x442;&#x44C; &#x44F; &#x438; &#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B; &#x432;&#x44B;&#x43A;&#x43B;&#x430;&#x434;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x44E;&#x434;&#x430; &#x432;&#x441;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43B;&#x435;&#x436;&#x430;&#x442; &#x432; &#x442;&#x435;&#x43B;&#x435;&#x433;&#x440;&#x430;&#x43C;-&#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x435; var_log_shitpost,
&#x43D;&#x43E; &#x432;&#x440;&#x44F;&#x434; &#x43B;&#x438; &#x44D;&#x442;&#x43E;&#x442; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B; &#x43C;&#x43E;&#x435;&#x433;&#x43E; &#x441;&#x430;&#x439;&#x442;&#x430; &#x445;&#x43E;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x435;&#x442;.</description>
      <pubDate>Mon, 13 Feb 2023 21:21:20 +0500</pubDate>
      <title>Life update</title>
      <guid>734d0d46-abba-11ed-b84d-d85ed3548165</guid>
    </item>
    <item>
      <description>Do you remember TCGs like Hearthstone or Magic the gathering? If you combine them with a turn-based
strategy you get Duelyst.
I'm glad to see more and more games getting open-sourced because it can serve as an example for
beginner game developer to learn from.</description>
      <pubDate>Fri, 13 Jan 2023 11:35:19 +0500</pubDate>
      <title>Turn-based strategy card game Duelyst released under CC0 license</title>
      <guid>2e1ec1d0-9308-11ed-a617-d85ed3548165</guid>
      <link>https://github.com/open-duelyst/duelyst</link>
    </item>
    <item>
      <description>I've added a rss bot in a matrix room. Now I can shitpost in rss and it'll be posted in matrix chat
room. Pretty cool, huh?</description>
      <pubDate>Fri, 13 Jan 2023 10:04:20 +0500</pubDate>
      <title>Matrix rss bot</title>
      <guid>bd3f4e1a-92ff-11ed-9127-d85ed3548165</guid>
      <link>https://matrix.to/#/#/var/log/shitpost:halogen.city</link>
    </item>
    <item>
      <description>Hi. This is my rss-only static microblog. Yeah it's pretty ugly rn, but I'll work on the style
later. Here, I'll post stuff that doesn't have as much info to deserve a full article on the blog.</description>
      <pubDate>Thu, 12 Jan 2023 20:27:40 +0500</pubDate>
      <title>Microblog</title>
      <guid>a6f734b4-928d-11ed-82e0-d85ed3548165</guid>
    </item>
  </channel>
</rss>
